https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html

# Essential basic functionality

In [1]:
import pandas as pd
import numpy as np

In [2]:
index = pd.date_range('1/1/2019',periods=8)

In [11]:
index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08'],
              dtype='datetime64[ns]', freq='D')

In [22]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    1.331132
b    0.718406
c    0.080788
d    0.462967
e    0.926048
dtype: float64

In [24]:
df = pd.DataFrame(np.random.randn(8,3),index=index,columns=['A','B','C'])

In [25]:
df

                   A         B         C
2019-01-01  0.146498 -0.800365 -0.596474
2019-01-02 -1.291924 -0.809541 -0.827662
2019-01-03  0.674604  1.493965  0.790137
2019-01-04  0.602992  0.762855  0.273925
2019-01-05  2.033115 -0.487244  0.542919
2019-01-06  0.265107 -1.724537  1.076319
2019-01-07  0.546746 -1.711256 -0.081782
2019-01-08 -0.285164 -0.364753 -0.475821

In [30]:
df.loc["2019"]

                   A         B         C
2019-01-01  0.146498 -0.800365 -0.596474
2019-01-02 -1.291924 -0.809541 -0.827662
2019-01-03  0.674604  1.493965  0.790137
2019-01-04  0.602992  0.762855  0.273925
2019-01-05  2.033115 -0.487244  0.542919
2019-01-06  0.265107 -1.724537  1.076319
2019-01-07  0.546746 -1.711256 -0.081782
2019-01-08 -0.285164 -0.364753 -0.475821

## Attributes and underlying data

#### pandas objects have a number of attributes enabling you to access the metadata

In [31]:
df.shape

(8, 3)

In [32]:
df[:2]

                   A         B         C
2019-01-01  0.146498 -0.800365 -0.596474
2019-01-02 -1.291924 -0.809541 -0.827662

In [33]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [34]:
df.columns = [x.lower() for x in df.columns]

In [35]:
df

                   a         b         c
2019-01-01  0.146498 -0.800365 -0.596474
2019-01-02 -1.291924 -0.809541 -0.827662
2019-01-03  0.674604  1.493965  0.790137
2019-01-04  0.602992  0.762855  0.273925
2019-01-05  2.033115 -0.487244  0.542919
2019-01-06  0.265107 -1.724537  1.076319
2019-01-07  0.546746 -1.711256 -0.081782
2019-01-08 -0.285164 -0.364753 -0.475821

Pandas objects (Index, Series, DataFrame) can be thought of as containers for arrays, which hold the actual data and do the actual computation. For many types, the underlying array is a numpy.ndarray. However, pandas and 3rd party libraries may extend NumPyâ€™s type system to add support for custom arrays (see dtypes).

To get the actual data inside a Index or Series, use the .array property

In [37]:
s.array

<PandasArray>
[ 1.3311323195096614,  0.7184056970505551,  0.0807876957235343,
 0.46296650639656134,  0.9260479463854028]
Length: 5, dtype: float64

In [39]:
df.index.array

<DatetimeArray>
['2019-01-01 00:00:00', '2019-01-02 00:00:00', '2019-01-03 00:00:00',
 '2019-01-04 00:00:00', '2019-01-05 00:00:00', '2019-01-06 00:00:00',
 '2019-01-07 00:00:00', '2019-01-08 00:00:00']
Length: 8, dtype: datetime64[ns]

**If you know you need a NumPy array, use to_numpy() or numpy.asarray().**

In [40]:
s.to_numpy()

array([1.33113232, 0.7184057 , 0.0807877 , 0.46296651, 0.92604795])

In [41]:
df.to_numpy()

array([[ 0.14649807, -0.80036452, -0.5964737 ],
       [-1.29192364, -0.8095407 , -0.82766185],
       [ 0.6746038 ,  1.49396464,  0.79013721],
       [ 0.60299206,  0.76285481,  0.27392523],
       [ 2.03311525, -0.48724413,  0.54291933],
       [ 0.26510704, -1.72453655,  1.07631929],
       [ 0.54674591, -1.71125559, -0.08178213],
       [-0.28516375, -0.36475327, -0.47582054]])

In [71]:
pd.DataFrame({
    'one':pd.Series(np.random.randn(3),index=[1,2,3]),
    'two':pd.Series(np.random.randn(4),index=[1,2,3,4])
             })

###### https://docs.scipy.org/doc/numpy-1.15.0/reference/routines.random.html

In [49]:
np.random.rand(5,2)

array([[0.91939029, 0.28784204],
       [0.20631817, 0.52174077],
       [0.39217836, 0.57359845],
       [0.41608609, 0.55160643],
       [0.8499213 , 0.34572229]])

In [63]:
np.random.randn(5,2)

array([[ 0.64001246, -0.74672476],
       [ 0.72585591, -2.71129693],
       [ 1.93968801, -1.23861383],
       [ 0.82780421,  0.587266  ],
       [ 0.84064902,  0.02692479]])

In [66]:
#Return random floats in the half-open interval [0.0, 1.0).
np.random.random(5)

array([0.65607109, 0.65419561, 0.42021657, 0.99253164, 0.43252533])

In [70]:
#Return random integers from low (inclusive) to high (exclusive).
np.random.randint(2,5,size=(5,2))

array([[4, 3],
       [3, 2],
       [4, 4],
       [4, 2],
       [4, 4]])

In [81]:
#pd.read_clipboard(na_values=[None], parse_dates=['d'])

## Flexible binary operations

With binary operations between pandas data structures, there are two key points of interest:

Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.
Missing data in computations.

###  Matching / broadcasting behavior

In [83]:
df = pd.DataFrame({
    'one':pd.Series(np.random.randn(3),index=['a','b','c']),
    'two':pd.Series(np.random.randn(4),index=['a','b','c','d']),
    'three':pd.Series(np.random.randn(3),index=['b','c','d'])
    
})
df

        one       two     three
a  0.968812 -1.142344       NaN
b  0.324877  0.288067  0.374192
c -1.690900  1.121951 -1.298059
d       NaN -1.759968 -1.705607

In [84]:
row = df.iloc[1]
row

one      0.324877
two      0.288067
three    0.374192
Name: b, dtype: float64

In [85]:
column = df['two']
column

a   -1.142344
b    0.288067
c    1.121951
d   -1.759968
Name: two, dtype: float64

In [89]:
df.sub(row,axis='columns')

        one       two     three
a  0.643934 -1.430410       NaN
b  0.000000  0.000000  0.000000
c -2.015778  0.833884 -1.672250
d       NaN -2.048035 -2.079799

In [90]:
df.sub(column, axis='index')

        one  two     three
a  2.111155  0.0       NaN
b  0.036811  0.0  0.086125
c -2.812851  0.0 -2.420009
d       NaN  0.0  0.054361

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08'],
              dtype='datetime64[ns]', freq='D')

Series and Index also support the divmod() builtin. This function takes the floor division and modulo operation at the same time returning a two-tuple of the same type as the left hand side. For example:

In [96]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [93]:
div, rem = divmod(s, 3)

In [94]:
div

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
9    3
dtype: int64

In [95]:
rem

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    0
dtype: int64

### Missing data / operations with fill values

In [97]:
df2=df

In [99]:
df+df2

        one       two     three
a  1.937623 -2.284687       NaN
b  0.649755  0.576133  0.748383
c -3.381800  2.243901 -2.596117
d       NaN -3.519937 -3.411215

In [108]:
(df.add(df2,fill_value=0)).fillna(0)

        one       two     three
a  1.937623 -2.284687  0.000000
b  0.649755  0.576133  0.748383
c -3.381800  2.243901 -2.596117
d  0.000000 -3.519937 -3.411215

### Boolean reductions

You can apply the reductions: empty, any(), all(), and bool() to provide a way to summarize a boolean result.

In [106]:
(df >0).all()

one      False
two      False
three    False
dtype: bool

In [107]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

In [109]:
#You can test if a pandas object is empty, via the empty property.
df.empty

False

### Comparing if objects are equivalent

Often you may find that there is more than one way to compute the same result. As a simple example, consider df + df and df * 2. To test that these two computations produce the same result, given the tools shown above, you might imagine using (df + df == df * 2).all(). But in fact, this expression is False:

In [110]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [112]:
#Notice that the boolean DataFrame df + df == df * 2 contains some False values! 
#This is because NaNs do not compare as equals:
np.nan == np.nan

False

In [113]:
(df+df).equals(df*2)

True

### Comparing array-like objects

In [114]:
pd.Series(['foo','bar','baz']) =='foo'

0     True
1    False
2    False
dtype: bool

In [115]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

## Descriptive statistics

In [117]:
df.mean(0)

one     -0.132404
two     -0.373074
three   -0.876491
dtype: float64

In [118]:
df.mean(1)

a   -0.086766
b    0.329045
c   -0.622336
d   -1.732788
dtype: float64

All such methods have a skipna option signaling whether to exclude missing data (True by default):

In [121]:
df.mean(axis=0,skipna=True)

one     -0.132404
two     -0.373074
three   -0.876491
dtype: float64

In [122]:
df = pd.DataFrame({
    'one':pd.Series(np.arange(3),index=['a','b','c']),
    'two':pd.Series(np.arange(4),index=['a','b','c','d']),
    'three':pd.Series(np.arange(3),index=['b','c','d'])
    
})
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [124]:
df.std()

one      1.000000
two      1.290994
three    1.000000
dtype: float64

In [129]:
((df-df.mean())/df.std()).std()

one      1.0
two      1.0
three    1.0
dtype: float64

Note that methods like cumsum() and cumprod() preserve the location of NaN values. This is somewhat different from expanding() and rolling(). For more details please see this [note](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#stats-moments-expanding-note)

In [130]:
df.cumsum()

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    0.0
c  3.0  3.0    1.0
d  NaN  6.0    3.0

Here is a quick reference summary table of common functions. Each also takes an optional level parameter which applies only if the object has a hierarchical index.

Function	Description

count	Number of non-NA observations
    sum	Sum of values
mean	Mean of values
    mad	Mean absolute deviation
median	Arithmetic median of values
    min	Minimum
    max	Maximum
mode	Mode
    abs	Absolute Value
prod	Product of values
    std	Bessel-corrected sample standard deviation
    var	Unbiased variance
    sem	Standard error of the mean
skew	Sample skewness (3rd moment)
kurt	Sample kurtosis (4th moment)
quantile	Sample quantile (value at %)
cumsum	Cumulative sum
cumprod	Cumulative product
cummax	Cumulative maximum
cummin	Cumulative minimum

In [131]:
#Note that by chance some NumPy methods, like mean, std, and sum, will exclude NAs on Series input by default:
np.mean(df['one'])

1.0

In [132]:
np.mean(df['one'].to_numpy())

nan

### Summarizing data: describe

In [133]:
series = pd.Series(np.random.randn(1000))
series[::2]=np.nan

In [134]:
series.describe()

count    500.000000
mean       0.021694
std        0.980243
min       -3.467144
25%       -0.596366
50%        0.011667
75%        0.648470
max        3.122625
dtype: float64

In [135]:
frame = pd.DataFrame(np.random.randn(1000, 5),
    columns=['a', 'b', 'c', 'd', 'e'])

In [136]:
frame.iloc[::2] = np.nan

In [137]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.052498   -0.028001   -0.041705    0.005442   -0.002915
std      1.012348    1.010122    0.964477    1.013019    0.993868
min     -2.989665   -2.851253   -3.448649   -3.543366   -3.239093
25%     -0.636087   -0.695931   -0.681534   -0.721773   -0.642027
50%      0.067491   -0.080417   -0.072155   -0.012134    0.015024
75%      0.683131    0.698961    0.616913    0.738867    0.626166
max      3.352948    3.425590    2.479393    3.021109    3.047629

In [139]:
frame.describe(percentiles=[0.25,0.95])

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.052498   -0.028001   -0.041705    0.005442   -0.002915
std      1.012348    1.010122    0.964477    1.013019    0.993868
min     -2.989665   -2.851253   -3.448649   -3.543366   -3.239093
25%     -0.636087   -0.695931   -0.681534   -0.721773   -0.642027
50%      0.067491   -0.080417   -0.072155   -0.012134    0.015024
95%      1.739601    1.604897    1.510598    1.621696    1.657490
max      3.352948    3.425590    2.479393    3.021109    3.047629

In [143]:
frame.describe(include='all')

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.052498   -0.028001   -0.041705    0.005442   -0.002915
std      1.012348    1.010122    0.964477    1.013019    0.993868
min     -2.989665   -2.851253   -3.448649   -3.543366   -3.239093
25%     -0.636087   -0.695931   -0.681534   -0.721773   -0.642027
50%      0.067491   -0.080417   -0.072155   -0.012134    0.015024
75%      0.683131    0.698961    0.616913    0.738867    0.626166
max      3.352948    3.425590    2.479393    3.021109    3.047629

In [144]:
frame.describe(include=['number'])

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.052498   -0.028001   -0.041705    0.005442   -0.002915
std      1.012348    1.010122    0.964477    1.013019    0.993868
min     -2.989665   -2.851253   -3.448649   -3.543366   -3.239093
25%     -0.636087   -0.695931   -0.681534   -0.721773   -0.642027
50%      0.067491   -0.080417   -0.072155   -0.012134    0.015024
75%      0.683131    0.698961    0.616913    0.738867    0.626166
max      3.352948    3.425590    2.479393    3.021109    3.047629

### Index of min/max values

In [145]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1

          A         B         C
0  0.350509 -1.298687 -1.539470
1 -0.604503  1.967911 -0.465778
2  0.125669  1.986730  1.020245
3 -0.028709 -1.555085 -0.236776
4 -0.841389  0.519869 -1.317559

In [147]:
df1.idxmax(axis=0)

A    0
B    2
C    2
dtype: int64

In [148]:
df1.idxmax(axis=1)

0    A
1    B
2    B
3    A
4    B
dtype: object

### Value counts (histogramming) / mode

In [149]:
data = np.random.randint(0,9,size=50)

In [150]:
df1 = pd.Series(data)

In [151]:
df1.value_counts()

2    10
3     9
6     8
5     7
7     5
8     4
4     4
1     2
0     1
dtype: int64

In [152]:
df1.mode()

0    2
dtype: int64

### Discretization and quantiling

Continuous values can be discretized using the cut() (bins based on values) and qcut() (bins based on sample quantiles) functions:

In [155]:
arr = np.arange(5)
factor = pd.cut(arr,4)
factor

[(-0.004, 1.0], (-0.004, 1.0], (1.0, 2.0], (2.0, 3.0], (3.0, 4.0]]
Categories (4, interval[float64]): [(-0.004, 1.0] < (1.0, 2.0] < (2.0, 3.0] < (3.0, 4.0]]

In [160]:
#qcut() computes sample quantiles. 
#For example, we could slice up some normally distributed data into equal-size quartiles like so:
arr = np.arange(10)
factor = pd.qcut(arr,[0,0.25,0.5,0.75,1])
factor

[(-0.001, 2.25], (-0.001, 2.25], (-0.001, 2.25], (2.25, 4.5], (2.25, 4.5], (4.5, 6.75], (4.5, 6.75], (6.75, 9.0], (6.75, 9.0], (6.75, 9.0]]
Categories (4, interval[float64]): [(-0.001, 2.25] < (2.25, 4.5] < (4.5, 6.75] < (6.75, 9.0]]

## Function application

To apply your own or another libraryâ€™s functions to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, row- or column-wise, or elementwise.

1. Tablewise Function Application: pipe()
2. Row or Column-wise Function Application: apply()
3. Aggregation API: agg() and transform()
4. Applying Elementwise Functions: applymap()

### Tablewise function application

In [161]:
def adder(e1,e2):
    return e1+e2

In [164]:
data = pd.Series(np.arange(10))
(data.pipe(adder,3)
.pipe(adder,3))

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
9    15
dtype: int64

In [167]:
data = pd.DataFrame(6*np.random.randn(6,3),columns=['c1','c2','c3'])
data

         c1         c2        c3
0 -0.719604 -15.475490 -2.078113
1  1.056824  -3.066823 -9.691638
2 -0.326919   2.421014 -4.535909
3  0.771495  -9.528416  0.206709
4 -8.627744  -0.259910 -6.982919
5  6.110030   4.025813 -1.531223

In [168]:
data.pipe(adder,3)

         c1         c2        c3
0  2.280396 -12.475490  0.921887
1  4.056824  -0.066823 -6.691638
2  2.673081   5.421014 -1.535909
3  3.771495  -6.528416  3.206709
4 -5.627744   2.740090 -3.982919
5  9.110030   7.025813  1.468777

### Row or column-wise function application

In [180]:
data1 = pd.Series(np.arange(10))
data1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [178]:
def seq(e1):
    return e1*e1

In [179]:
data1.apply(seq)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [181]:
data.apply(seq)

          c1          c2         c3
0   0.517830  239.490788   4.318555
1   1.116876    9.405401  93.927851
2   0.106876    5.861308  20.574469
3   0.595205   90.790709   0.042729
4  74.437959    0.067553  48.761151
5  37.332464   16.207169   2.344644

In [184]:
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [183]:
df.apply(np.mean)

one      1.0
two      1.5
three    1.0
dtype: float64

In [185]:
df.apply(np.mean,axis=1)

a    0.000000
b    0.666667
c    1.666667
d    2.500000
dtype: float64

In [186]:
df.apply(lambda x:x.max()-x.min())

one      2.0
two      3.0
three    2.0
dtype: float64

In [189]:
df.apply(np.cumsum)

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  3.0    3    1.0
d  NaN    6    3.0

In [190]:
df.apply(np.exp)

        one        two     three
a  1.000000   1.000000       NaN
b  2.718282   2.718282  1.000000
c  7.389056   7.389056  2.718282
d       NaN  20.085537  7.389056

In [191]:
#The apply() method will also dispatch on a string method name.
df.apply("mean")

one      1.0
two      1.5
three    1.0
dtype: float64

If the applied function returns a Series, the final output is a DataFrame. The columns match the index of the Series returned by the applied function.


If the applied function returns any other type, the final output is a Series.

In [193]:
pd.date_range('1/1/2019',periods=5)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05'],
              dtype='datetime64[ns]', freq='D')

In [194]:
tsdf = pd.DataFrame(np.random.randn(1000,3),columns=['a','b','c'],index = pd.date_range("1/1/2019",periods=1000))

In [195]:
tsdf.head()

                   a         b         c
2019-01-01 -0.073681  1.602625 -0.506176
2019-01-02 -1.306398 -1.100492  1.235835
2019-01-03 -0.822071  0.689919  1.298869
2019-01-04 -0.133497  0.625475 -0.997172
2019-01-05 -0.517860 -0.380640 -0.858498

In [196]:
#apply() combined with some cleverness can be used to answer many questions about a data set. 
#For example, suppose we wanted to extract the date where the maximum value for each column occurred:

tsdf.apply(np.max)

a    3.903163
b    3.770102
c    3.424781
dtype: float64

In [197]:
tsdf.apply(lambda x : x.idxmax())

a   2019-01-08
b   2021-02-16
c   2021-09-18
dtype: datetime64[ns]

In [202]:
#You may also pass additional arguments and keyword arguments to the apply() method. 
#For instance, consider the following function you would like to apply:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [203]:
df.apply(subtract_and_divide, args=(5,), divide=3)

        one       two     three
a -1.666667 -1.666667       NaN
b -1.333333 -1.333333 -1.666667
c -1.000000 -1.000000 -1.333333
d       NaN -0.666667 -1.000000

In [206]:
#Another useful feature is the ability to pass Series methods to carry out some Series operation on each column or row:
#https://www.geeksforgeeks.org/python-pandas-dataframe-interpolate/
tsdf.apply(pd.Series.interpolate).head()

                   a         b         c
2019-01-01 -0.073681  1.602625 -0.506176
2019-01-02 -1.306398 -1.100492  1.235835
2019-01-03 -0.822071  0.689919  1.298869
2019-01-04 -0.133497  0.625475 -0.997172
2019-01-05 -0.517860 -0.380640 -0.858498

### Aggregation API

The aggregation API allows one to express possibly multiple aggregation operations in a single concise way. 
<br>
This API is similar across pandas objects, see [groupby API](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#groupby-aggregate), the [window functions API](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#stats-aggregate), and the resample API. The entry point for aggregation is DataFrame.aggregate(), or the alias DataFrame.agg().

In [207]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],index=pd.date_range('1/1/2000', periods=10))

In [209]:
tsdf.iloc[3:7] = np.nan
tsdf

                   A         B         C
2000-01-01  0.832655 -0.524485 -0.675639
2000-01-02 -1.167355  0.012392  1.462209
2000-01-03 -0.444591 -0.668486 -2.107690
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  1.090773 -1.284720 -1.078714
2000-01-09  0.263542 -1.569046  1.106923
2000-01-10  1.545289  0.817526 -1.167118

In [213]:
#Using a single function is equivalent to apply(). 
#You can also pass named methods as strings. These will return a Series of the aggregated output:

tsdf.agg(np.sum)

A    2.120313
B   -3.216819
C   -2.460030
dtype: float64

In [214]:
tsdf.agg('sum')

A    2.120313
B   -3.216819
C   -2.460030
dtype: float64

In [212]:
tsdf.sum()

A    2.120313
B   -3.216819
C   -2.460030
dtype: float64

In [215]:
# these are equivalent to a ``.sum()`` because we are aggregating
# on a single function

### Aggregating with multiple functions

In [216]:
tsdf.agg(["sum","mean"])

             A         B         C
sum   2.120313 -3.216819 -2.460030
mean  0.353385 -0.536137 -0.410005

In [217]:
tsdf.agg([np.sum,np.mean])

             A         B         C
sum   2.120313 -3.216819 -2.460030
mean  0.353385 -0.536137 -0.410005

In [218]:
tsdf.A.agg(['sum', 'mean'])

sum     2.120313
mean    0.353385
Name: A, dtype: float64

In [219]:
tsdf.agg(['sum',lambda x: x.mean()])

                 A         B         C
sum       2.120313 -3.216819 -2.460030
<lambda>  0.353385 -0.536137 -0.410005

In [220]:
def getmean(x):
    return x.mean()

In [221]:
tsdf.agg(['sum',getmean])

                A         B         C
sum      2.120313 -3.216819 -2.460030
getmean  0.353385 -0.536137 -0.410005

### Aggregating with a dict

In [225]:
tsdf.agg({'A': 'mean', 'B': 'sum'})

A    0.353385
B   -3.216819
dtype: float64

In [226]:
tsdf.agg({'A': ['mean','min'], 'B': 'sum'})

             A         B
mean  0.353385       NaN
min  -1.167355       NaN
sum        NaN -3.216819

### Mixed dtypes

When presented with mixed dtypes that cannot aggregate, .agg will only take the valid aggregations. This is similar to how groupby .agg works.

In [227]:
mdf = pd.DataFrame({'A': [1, 2, 3],
                       'B': [1., 2., 3.],
                        'C': ['foo', 'bar', 'baz'],
                        'D': pd.date_range('20130101', periods=3)})

In [228]:
mdf.agg(['sum','mean'])

        A    B          C
sum   6.0  6.0  foobarbaz
mean  2.0  2.0        NaN

### Custom describe

Partial functions allow one to derive a function with x parameters to a function with fewer parameters and fixed values set for the more limited function.

In [233]:
pd.Series.quantile(pd.Series([1,2,3,4]),q=0.25)

1.75

In [234]:
from functools import partial

In [235]:
q_25 = partial(pd.Series.quantile, q=0.25)
q_25.__name__ = '25%'

In [236]:
q_75 = partial(pd.Series.quantile, q=0.75)
q_75.__name__ = '75%'

In [237]:
tsdf.agg(['count', 'mean', 'std', 'min', q_25, 'median', q_75, 'max'])

               A         B         C
count   6.000000  6.000000  6.000000
mean    0.353385 -0.536137 -0.410005
std     1.015043  0.869277  1.398524
min    -1.167355 -1.569046 -2.107690
25%    -0.267558 -1.130661 -1.145017
median  0.548099 -0.596486 -0.877176
75%     1.026244 -0.121827  0.661282
max     1.545289  0.817526  1.462209

### Transform API
#### The transform() method returns an object that is indexed the same (same size) as the original.?

In [5]:
# agg vs tranform
df = pd.DataFrame(dict(A=list('aabb'), B=[1, 2, 3, 4], C=[0, 9, 0, 9]))
df

   A  B  C
0  a  1  0
1  a  2  9
2  b  3  0
3  b  4  9

In [3]:
df.groupby('A').agg('mean')

     B    C
A
a  1.5  4.5
b  3.5  4.5

In [4]:
df.groupby("A").transform('mean')

     B    C
0  1.5  4.5
1  1.5  4.5
2  3.5  4.5
3  3.5  4.5

In [8]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],
    index=pd.date_range('1/1/2000', periods=10))
tsdf.iloc[3:7] = np.nan

In [9]:
tsdf

                   A         B         C
2000-01-01 -0.530080 -0.362637  0.204049
2000-01-02 -1.098446 -1.310623  0.789792
2000-01-03 -0.161723  2.211703 -1.577720
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08 -1.280902 -0.323577 -0.880143
2000-01-09 -0.413311 -0.041518 -0.129362
2000-01-10  0.406999  0.913788 -0.344611

In [12]:
tsdf.transform(np.abs)

                   A         B         C
2000-01-01  0.530080  0.362637  0.204049
2000-01-02  1.098446  1.310623  0.789792
2000-01-03  0.161723  2.211703  1.577720
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  1.280902  0.323577  0.880143
2000-01-09  0.413311  0.041518  0.129362
2000-01-10  0.406999  0.913788  0.344611

In [13]:
tsdf.transform('abs')

                   A         B         C
2000-01-01  0.530080  0.362637  0.204049
2000-01-02  1.098446  1.310623  0.789792
2000-01-03  0.161723  2.211703  1.577720
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  1.280902  0.323577  0.880143
2000-01-09  0.413311  0.041518  0.129362
2000-01-10  0.406999  0.913788  0.344611

In [15]:
tsdf.transform(lambda x : x.abs())

                   A         B         C
2000-01-01  0.530080  0.362637  0.204049
2000-01-02  1.098446  1.310623  0.789792
2000-01-03  0.161723  2.211703  1.577720
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  1.280902  0.323577  0.880143
2000-01-09  0.413311  0.041518  0.129362
2000-01-10  0.406999  0.913788  0.344611

In [16]:
tsdf.transform([np.abs, lambda x: x + 1])

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2000-01-01  0.530080  0.469920  0.362637  0.637363  0.204049  1.204049
2000-01-02  1.098446 -0.098446  1.310623 -0.310623  0.789792  1.789792
2000-01-03  0.161723  0.838277  2.211703  3.211703  1.577720 -0.577720
2000-01-04       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-08  1.280902 -0.280902  0.323577  0.676423  0.880143  0.119857
2000-01-09  0.413311  0.586689  0.041518  0.958482  0.129362  0.870638
2000-01-10  0.406999  1.406999  0.913788  1.913788  0.344611  0.655389

#### Transforming with a dict
##### Passing a dict of functions will allow selective transforming per column.

In [18]:
tsdf.transform({'A':np.abs,'B':lambda x:x+1})

                   A         B
2000-01-01  0.530080  0.637363
2000-01-02  1.098446 -0.310623
2000-01-03  0.161723  3.211703
2000-01-04       NaN       NaN
2000-01-05       NaN       NaN
2000-01-06       NaN       NaN
2000-01-07       NaN       NaN
2000-01-08  1.280902  0.676423
2000-01-09  0.413311  0.958482
2000-01-10  0.406999  1.913788

### Applying elementwise functions

In [19]:
df = pd.DataFrame({
    'one':pd.Series(np.arange(3),index=['a','b','c']),
    'two':pd.Series(np.arange(4),index=['a','b','c','d']),
    'three':pd.Series(np.arange(3),index=['b','c','d'])
    
})
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [20]:
def f(x):
    return len(str(x))

In [21]:
df.applymap(f)

   one  two  three
a    3    1      3
b    3    1      3
c    3    1      3
d    3    1      3

In [22]:
df.one.map(f)

a    3
b    3
c    3
d    3
Name: one, dtype: int64

In [23]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],
                 index=['a', 'b', 'c', 'd', 'e'])
s

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [24]:
t = pd.Series({'six': 6., 'seven': 7.})

In [25]:
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

In [26]:
# let's say we have a dataframe with names 
name = pd.DataFrame(data = ['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)'], columns = ['Name'] )

#Take a look at the Data 
name.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [32]:
name['title']=name.Name.apply(lambda x: x.split(" ")[1].replace(".", ""))

In [33]:
name

                                                Name   title
0                            Braund, Mr. Owen Harris      Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Mrs
2                             Heikkinen, Miss. Laina    Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Mrs
4                           Allen, Mr. William Henry      Mr
5                                   Moran, Mr. James      Mr
6                            McCarthy, Mr. Timothy J      Mr
7                     Palsson, Master. Gosta Leonard  Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)     Mrs

In [34]:
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [38]:
df["one"]*df["two"]

a    0.0
b    1.0
c    4.0
d    NaN
dtype: float64

## apply vs applymap

In [42]:
# np.cumsum doesn;t work with appplymap. it works only with apply 
df.applymap(np.cumsum)

     one  two  three
a  [0.0]  [0]  [nan]
b  [1.0]  [1]  [0.0]
c  [2.0]  [2]  [1.0]
d  [nan]  [3]  [2.0]

In [43]:
df.apply(np.cumsum)

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  3.0    3    1.0
d  NaN    6    3.0

In [44]:
df.apply(lambda x: x.max() - x.min())

one      2.0
two      3.0
three    2.0
dtype: float64

In [47]:
#throws error
df.applymap(lambda x: x.max() - x.min())

In [ ]:
#Throws error
df.one.map(lambda x: x.max() - x.min())

In [49]:
df.applymap(np.mean)

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    0.0
c  2.0  2.0    1.0
d  NaN  3.0    2.0

In [50]:
df.apply('mean')

one      1.0
two      1.5
three    1.0
dtype: float64

In [57]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

## Reindexing and altering labels

Note : When writing performance-sensitive code, there is a good reason to spend some time becoming a reindexing ninja: many operations are faster on pre-aligned data. Adding two unaligned DataFrames internally triggers a reindexing step. For exploratory analysis you will hardly notice the difference (because reindex has been heavily optimized), but when CPU cycles matter sprinkling a few explicit reindex calls here and there can have an impact.

reindex() is the fundamental data alignment method in pandas. It is used to implement nearly all other features relying on label-alignment functionality. 
To reindex means to conform the data to match a given set of labels along a particular axis. 

This accomplishes several things:

        1. Reorders the existing data to match a new set of labels
        2. Inserts missing value (NA) markers in label locations where no data for that label existed
        3. If specified, fill data for missing labels using logic (highly relevant to working with time series data)

In [62]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'])
s

a    1.030530
b    0.692255
c   -1.508018
d   -0.349647
e    0.184688
dtype: float64

In [64]:
#Here, the f label was not contained in the Series and hence appears as NaN in the result.
s.reindex(['b','f','d'])

b    0.692255
f         NaN
d   -0.349647
dtype: float64

In [65]:
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [67]:
df.reindex(index=['b','f','d'],columns=['three','two','one'])

   three  two  one
b    0.0  1.0  1.0
f    NaN  NaN  NaN
d    2.0  3.0  NaN

In [70]:
df.reindex(['c','f','b'],axis='index')

   one  two  three
c  2.0  2.0    1.0
f  NaN  NaN    NaN
b  1.0  1.0    0.0

In [71]:
rs = s.reindex(df.index)

In [72]:
rs

a    1.030530
b    0.692255
c   -1.508018
d   -0.349647
dtype: float64

In [73]:
rs.index is df.index

True

In [74]:
df.reindex(['three', 'two', 'one'], axis='columns')

   three  two  one
a    NaN    0  0.0
b    0.0    1  1.0
c    1.0    2  2.0
d    2.0    3  NaN

### Aligning objects with each other with align

In [75]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [76]:
s1=s[:4]
s2=s[1:]

In [77]:
s1

a   -0.045234
b   -0.130608
c    1.282267
d   -0.175234
dtype: float64

In [78]:
s2

b   -0.130608
c    1.282267
d   -0.175234
e    1.044420
dtype: float64

In [79]:
s1.align(s2)

(a   -0.045234
 b   -0.130608
 c    1.282267
 d   -0.175234
 e         NaN
 dtype: float64, a         NaN
 b   -0.130608
 c    1.282267
 d   -0.175234
 e    1.044420
 dtype: float64)

In [80]:
s1.align(s2,join='inner')

(b   -0.130608
 c    1.282267
 d   -0.175234
 dtype: float64, b   -0.130608
 c    1.282267
 d   -0.175234
 dtype: float64)

In [82]:
s1.align(s2,join='left')

(a   -0.045234
 b   -0.130608
 c    1.282267
 d   -0.175234
 dtype: float64, a         NaN
 b   -0.130608
 c    1.282267
 d   -0.175234
 dtype: float64)

### Filling while reindexing

In [84]:
rng =pd.date_range('01/10/2019',periods=9)
ts = pd.Series(np.random.randn(9),index=rng)
ts

2019-01-10    0.235594
2019-01-11   -0.109534
2019-01-12   -0.540557
2019-01-13    0.251664
2019-01-14    0.912234
2019-01-15   -1.327685
2019-01-16    0.171194
2019-01-17   -0.570680
2019-01-18   -1.906918
Freq: D, dtype: float64

In [85]:
ts2 = ts[[0, 3, 6]]
ts2

2019-01-10    0.235594
2019-01-13    0.251664
2019-01-16    0.171194
dtype: float64

In [87]:
ts2.reindex(ts.index)

2019-01-10    0.235594
2019-01-11         NaN
2019-01-12         NaN
2019-01-13    0.251664
2019-01-14         NaN
2019-01-15         NaN
2019-01-16    0.171194
2019-01-17         NaN
2019-01-18         NaN
Freq: D, dtype: float64

In [89]:
ts2.reindex(ts.index,method='ffill')

2019-01-10    0.235594
2019-01-11    0.235594
2019-01-12    0.235594
2019-01-13    0.251664
2019-01-14    0.251664
2019-01-15    0.251664
2019-01-16    0.171194
2019-01-17    0.171194
2019-01-18    0.171194
Freq: D, dtype: float64

In [90]:
ts2.reindex(ts.index,method='bfill')

2019-01-10    0.235594
2019-01-11    0.251664
2019-01-12    0.251664
2019-01-13    0.251664
2019-01-14    0.171194
2019-01-15    0.171194
2019-01-16    0.171194
2019-01-17         NaN
2019-01-18         NaN
Freq: D, dtype: float64

In [91]:
ts2.reindex(ts.index,method='nearest')

2019-01-10    0.235594
2019-01-11    0.235594
2019-01-12    0.251664
2019-01-13    0.251664
2019-01-14    0.251664
2019-01-15    0.171194
2019-01-16    0.171194
2019-01-17    0.171194
2019-01-18    0.171194
Freq: D, dtype: float64

These methods require that the indexes are ordered increasing or decreasing.

Note that the same result could have been achieved using fillna (except for method='nearest') or interpolate:

In [93]:
ts2.reindex(ts.index).fillna(method="ffill")

2019-01-10    0.235594
2019-01-11    0.235594
2019-01-12    0.235594
2019-01-13    0.251664
2019-01-14    0.251664
2019-01-15    0.251664
2019-01-16    0.171194
2019-01-17    0.171194
2019-01-18    0.171194
Freq: D, dtype: float64

### Limits on filling while reindexing

In [94]:
ts2.reindex(ts.index,method='ffill',limit=1)

2019-01-10    0.235594
2019-01-11    0.235594
2019-01-12         NaN
2019-01-13    0.251664
2019-01-14    0.251664
2019-01-15         NaN
2019-01-16    0.171194
2019-01-17    0.171194
2019-01-18         NaN
Freq: D, dtype: float64

In [95]:
ts2.reindex(ts.index,method='ffill',tolerance='1day')

2019-01-10    0.235594
2019-01-11    0.235594
2019-01-12         NaN
2019-01-13    0.251664
2019-01-14    0.251664
2019-01-15         NaN
2019-01-16    0.171194
2019-01-17    0.171194
2019-01-18         NaN
Freq: D, dtype: float64

### Dropping labels from an axis

In [96]:
df

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0
d  NaN    3    2.0

In [97]:
df.drop(['d'],axis=0)

   one  two  three
a  0.0    0    NaN
b  1.0    1    0.0
c  2.0    2    1.0

In [100]:
df.drop(['one'],axis=1)

   two  three
a    0    NaN
b    1    0.0
c    2    1.0
d    3    2.0

In [101]:
df.index.difference(['a','b'])

Index(['c', 'd'], dtype='object')

In [102]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
  index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

        foo  bar  three
apple   0.0    0    NaN
banana  1.0    1    0.0
c       2.0    2    1.0
durian  NaN    3    2.0

## MultiIndex / advanced indexing

### Hierarchical indexing (MultiIndex)

### Creating a MultiIndex (hierarchical index) object

In [103]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], 
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
arrays

[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [108]:
tuples = list(zip(*arrays))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [113]:
index = pd.MultiIndex.from_tuples(tuples,names=["first","second"])

In [114]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [115]:
s = pd.Series(np.random.randn(8),index=index)

In [116]:
s

first  second
bar    one      -0.319659
       two      -0.051768
baz    one      -0.046414
       two      -2.056756
foo    one      -0.388370
       two      -0.005102
qux    one       0.217895
       two       0.456359
dtype: float64

In [117]:
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]
iterables

[['bar', 'baz', 'foo', 'qux'], ['one', 'two']]

In [122]:
index = pd.MultiIndex.from_product(iterables,names=["first","second"])

In [123]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [124]:
df = pd.DataFrame([['bar', 'one'], ['bar', 'two'],
            ['foo', 'one'], ['foo', 'two']],
            columns=['first', 'second'])

In [125]:
pd.MultiIndex.from_frame(df)

MultiIndex(levels=[['bar', 'foo'], ['one', 'two']],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['first', 'second'])

As a convenience, you can pass a list of arrays directly into Series or DataFrame to construct a MultiIndex automatically:

In [126]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
      np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]

In [127]:
arrays

[array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
       dtype='<U3'),
 array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],
       dtype='<U3')]

In [128]:
s = pd.Series(np.random.randn(8), index=arrays)
s

bar  one   -1.746619
     two    1.992336
baz  one    1.137685
     two    0.037254
foo  one    0.101687
     two   -0.880463
qux  one    0.065372
     two    0.177606
dtype: float64

In [129]:
pd.DataFrame(np.random.randn(8, 4), index=arrays)

                0         1         2         3
bar one  1.303902  1.494400 -0.339205 -0.028566
    two  1.931457  0.646858  0.524747 -0.823532
baz one  0.765561  1.347769 -0.144384  0.410093
    two  1.155271  1.203738  0.359085  0.605012
foo one -0.390859  0.591712 -0.309718  1.248246
    two  0.175469 -1.162716  0.563752  0.035603
qux one -0.579899  0.099052  1.748527  0.067102
    two -1.171864 -0.173024 -1.376776  1.115933

All of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:

In [130]:
df.index.names

FrozenList([None])

This index can back any axis of a pandas object, and the number of levels of the index is up to you:

In [131]:
df=pd.DataFrame(np.random.randn(3,8),index=["a","b","c"],columns=index)

In [132]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
a      -0.302425  0.470812 -0.055743  1.935574 -0.711323  0.499283 -0.577964
b      -1.480385  1.289984  0.141651  0.859252 -0.852149 -0.088208 -0.385612
c      -0.837558 -0.778143  1.664475  0.281666 -1.726430 -1.386871 -0.467357

first
second       two
a       0.633384
b       1.015916
c      -0.144547

In [133]:
pd.DataFrame(np.random.randn(6, 6), index=index[:6], columns=index[:6])

first              bar                 baz                 foo
second             one       two       one       two       one       two
first second
bar   one     2.158361  1.779550  0.668959 -0.953464 -0.382294 -0.710024
      two     0.860234 -2.023424 -0.972071  0.619652 -0.523400 -0.034633
baz   one    -0.380358 -0.111118 -0.391673  1.656157  0.456672 -0.640379
      two     1.097102  1.064782  0.829979  1.216068  0.427915 -1.002310
foo   one    -1.379379 -0.214646  1.061154  1.161300  1.798402  0.222788
      two     0.157296 -0.125296  0.630422 -1.855339 -1.183465 -0.709996

In [134]:
with pd.option_context('display.multi_sparse', False):
      df

In [135]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
a      -0.302425  0.470812 -0.055743  1.935574 -0.711323  0.499283 -0.577964
b      -1.480385  1.289984  0.141651  0.859252 -0.852149 -0.088208 -0.385612
c      -0.837558 -0.778143  1.664475  0.281666 -1.726430 -1.386871 -0.467357

first
second       two
a       0.633384
b       1.015916
c      -0.144547

### Reconstructing the level labels

In [146]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [149]:
index.get_level_values("second")

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

### Basic indexing on axis with MultiIndex
Partial selection â€œdropsâ€ levels of the hierarchical index in the result in a completely analogous way to selecting a column in a regular DataFrame:

In [150]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
a      -0.302425  0.470812 -0.055743  1.935574 -0.711323  0.499283 -0.577964
b      -1.480385  1.289984  0.141651  0.859252 -0.852149 -0.088208 -0.385612
c      -0.837558 -0.778143  1.664475  0.281666 -1.726430 -1.386871 -0.467357

first
second       two
a       0.633384
b       1.015916
c      -0.144547

In [182]:
df.loc["b"]

first  second
bar    one      -1.480385
       two       1.289984
baz    one       0.141651
       two       0.859252
foo    one      -0.852149
       two      -0.088208
qux    one      -0.385612
       two       1.015916
Name: b, dtype: float64

In [183]:
df[['foo','bar']]

first        foo                 bar
second       one       two       one       two
a      -0.711323  0.499283 -0.302425  0.470812
b      -0.852149 -0.088208 -1.480385  1.289984
c      -1.726430 -1.386871 -0.837558 -0.778143

In [151]:
df['bar']

second       one       two
a      -0.302425  0.470812
b      -1.480385  1.289984
c      -0.837558 -0.778143

In [154]:
df['bar','one']

a   -0.302425
b   -1.480385
c   -0.837558
Name: (bar, one), dtype: float64

In [155]:
df['bar']['one']

a   -0.302425
b   -1.480385
c   -0.837558
Name: one, dtype: float64

In [156]:
s['qux']

one    0.065372
two    0.177606
dtype: float64

### Defined levels
The MultiIndex keeps all the defined levels of an index, even if they are not actually used. When slicing an index, you may notice this. For example:

In [158]:
df[['bar','baz']].columns.levels

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

This is done to avoid a recomputation of the levels in order to make slicing highly performant. If you want to see only the used levels, you can use the get_level_values() method.

In [161]:
df[['foo', 'qux']].columns.get_level_values(0)

Index(['foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [163]:
#To reconstruct the MultiIndex with only the used levels, the remove_unused_levels() method may be used.
new_mi = df[['foo', 'qux']].columns.remove_unused_levels()
new_mi.levels

FrozenList([['foo', 'qux'], ['one', 'two']])

### Data alignment and using reindex

In [164]:
s+s[:6]

bar  one   -3.493237
     two    3.984673
baz  one    2.275369
     two    0.074508
foo  one    0.203374
     two   -1.760927
qux  one         NaN
     two         NaN
dtype: float64

In [165]:
s+s[::2]

bar  one   -3.493237
     two         NaN
baz  one    2.275369
     two         NaN
foo  one    0.203374
     two         NaN
qux  one    0.130743
     two         NaN
dtype: float64

In [171]:
index[:3]

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1], [0, 1, 0]],
           names=['first', 'second'])

In [178]:
s

bar  one   -1.746619
     two    1.992336
baz  one    1.137685
     two    0.037254
foo  one    0.101687
     two   -0.880463
qux  one    0.065372
     two    0.177606
dtype: float64

In [172]:
s.reindex(index[:3])

first  second
bar    one      -1.746619
       two       1.992336
baz    one       1.137685
dtype: float64

In [176]:
s.index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]])

In [179]:
s.reindex([('foo', 'two'), ('bar', 'one'), ('qux', 'one'), ('baz', 'one')])

foo  two   -0.880463
bar  one   -1.746619
qux  one    0.065372
baz  one    1.137685
dtype: float64